def area(a, b, c):
    '''
    Описание: Эта функция вычисляет полупериметр треугольника.
    Параметры:
    a: первая сторона треугольника
    b: вторая сторона треугольника
    c: третья сторона треугольника
    Возвращаемое значение: Полупериметр треугольника по формуле(a+b+c)/2.
    '''
    return (a + b + c) / 2


def perimeter(a, b, c):
    '''
    Описание: Эта функция вычисляет полный периметр треугольника.
    Параметры:
    a(int): первая сторона треугольника
    b(int): вторая сторона треугольника
    c(int): третья сторона треугольника
    Возвращаемое значение: Периметр треугольника, сумма всех сторон.
    Файл предоставляет базовые вычисления для работы с треугольниками.
    '''
    return a + b + c
